{"inkVersion":21,"root":[["\n","\n","\n","\n","\n","\n",{"->":"introduction"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"introduction":[["^You finally finish the 7-day trek through the woods to find yourself in front of the forgotten, dilapidated village. This village has been lost to time by the rest of the world; the people don't seem interested in interacting with the rest of the world. There seems to be nothing left of the simple life and joy that you were told existed here. The abominations have been too regular as of late it seems.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":"describe_villagers"},{"#f":5}]}],{"#f":1}],"describe_villagers":[["^The few villagers that are left appear to be living in a life of squalor.","\n","^Everyone ignores your gaze as you attempt to find the person that had asked you here in the first place.","\n","ev","str","^Look around","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":"describe_villagers_2"},{"#f":5}]}],{"#f":1}],"describe_villagers_2":[["^As you get to the town hall, you see someone. Not quite human, yet not too different either...","\n","ev","str","^Approach them","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":"info_from_mother"},{"#f":5}]}],{"#f":1}],"info_from_mother":["^You go to approach the stranger, but there is a sudden tight grip on your arm. A haggard woman has rushed over to you, and she yanks you into the crumbling yet imposing town hall.","\n",{"->":"info_from_mother_2"},{"#f":1}],"info_from_mother_2":[["#","^speaker:WOMAN","/#","^\"You don't want to stay out in the town for too long, we can't have the person who's supposed to be finding my daughter getting snatched by a variant, can we?\"","\n","^She sounds DISTRESSED and SUSPICIOUS.","\n","^Choose correctly to gain her trust and valuable clues.","\n","ev","str","^Ask for more info","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Be confident","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"info_from_mother_wrong"},{"#f":5}],"c-1":["\n","^\"I'm here to help you. Tell me about your daughter.\"","\n",{"->":"info_from_mother_right"},{"#f":5}]}],{"#f":1}],"info_from_mother_wrong":[["#","^speaker:YOU","/#","^\"Wait, who are you?\"","\n","#","^speaker:WOMAN","/#","^\"I thought you were...wait...\"","\n","^The witness doesn't trust you, try again.","\n","ev","str","^I'm here to help you.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Don't worry about who I am.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","#","^speaker:YOU","/#","^\"I'm here to help you. Tell me about Lena.\"","\n","#","^speaker:WOMAN","/#","^\"So they did send you!\"","\n",{"->":"info_from_mother_right"},{"#f":5}],"c-1":["\n",{"->":"mother_conclusion"},{"#f":5}]}],{"#f":1}],"info_from_mother_right":[["#","^speaker:WOMAN","/#","^\"You don't want to stay around those VARIANTS for long. For all we know, that one you were gawking at took my Lena away from me.\"","\n","ev","str","^Variants?","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"info_from_mother_3"},{"#f":5}]}],{"#f":1}],"info_from_mother_3":[["#","^speaker:WOMAN","/#","^\"Those kinds are sneaky. It's far too easy for them to have stolen her away from me in the night. If it was up to us, they would have been driven out of here long ago.\"","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"mother_conclusion"},{"#f":5}]}],{"#f":1}],"mother_conclusion":["^You get the sense that there is a lot of hostility in this town.","\n","ev",{"CNT?":"info_from_mother_right"},"_","/ev",[{"->":".^.b","c":true},{"b":["\n","^You don't know if you can trust that this Variant had anything to do with the missing girl, but it's the only lead you have for now.","\n","ev","str","^NEW WITNESS: Variant","/str","/ev",{"*":".^.c-0","flg":4},{"->":".^.^.^.8"},{"c-0":["\n",{"->":"mutant_introduction"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n","#","^speaker:WOMAN","/#","^\"Actually, I'm not sure I should be speaking to you...\"","\n","^The woman hasn't been very forthcoming with you. Restart the conversation?","\n","ev","str","^Go back","/str","/ev",{"*":".^.c-0","flg":4},{"->":".^.^.^.8"},{"c-0":["\n",{"->":"info_from_mother"},{"#f":5}]}]}],"nop","\n",{"#f":1}],"mutant_introduction":[["^You go back outside. The village is even more deserted than when you arrived.","\n","^The VARIANT is still standing where you left them, eyes gazing at nothing in particular. With a vacant expression like that, surely they can't be intelligent enough to be involved in the kidnapping...can they?","\n","ev","str","^Hey, can I ask you some questions?","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"mutant_dialogue"},{"#f":5}]}],{"#f":1}],"mutant_dialogue":[["#","^speaker:YOU","/#","^\"Can I ask you a few questions about the girl that's recently gone missing around here?\"","\n","#","^speaker:VARIANT","/#","^\"Are you working with the people from the town so you can drive the rest of us out of here?\"","\n","^The Variant seems CONFIDENT and HOSTILE.","\n","ev","str","^Be friendly","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Be accusatory","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"variant_info_right"},{"#f":5}],"c-1":["\n",{"->":"variant_info_wrong"},{"#f":5}]}],{"#f":1}],"variant_info_right":[["#","^speaker:YOU","/#","^\"I have no judgements about this place and I'm not trying to pin this on you.\"","\n","#","^speaker:VARIANT","/#","^\"You'd be the first. The town has been trying to get rid of us forever, but this is our home too so we're just doing what we can to survive. That girl and her witch friends didn't like us much either.\"","\n","ev","str","^Witches?","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"variant_info_2"},{"#f":5}]}],{"#f":1}],"variant_info_wrong":[["#","^speaker:YOU","/#","^\"The townspeople seem to think you could have something to do with the missing girl.\"","\n","#","^speaker:VARIANT","/#","^\"Look at you, coming in all guns blazing. You know nothing about this place.\"","\n","^The Variant doesn't trust you. Try again.","\n","ev","str","^Back off","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Stand your ground","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"variant_info_right"},{"#f":5}],"c-1":["\n","#","^speaker:YOU","/#","^\"The townspeople are terrified of you, they must have a good reason to be.\"","\n","#","^speaker:VARIANT","/#","^\"They're just afraid of what they don't understand. Like you.\"","\n",{"->":"variant_conclusion"},{"#f":5}]}],{"#f":1}],"variant_info_2":["#","^speaker:VARIANT","/#","^\"A cult, more like. They're the ones stealing children.\"","\n",{"->":"variant_conclusion"},{"#f":1}],"variant_conclusion":["^All these people hating each other and still living so close together. Was Lena really taken, or did she leave of her own accord?","\n","ev",{"CNT?":"variant_info_right"},"_","/ev",[{"->":".^.b","c":true},{"b":["\n","^Sounds like the witches at the edge of town could have seen her recently.","\n","ev","str","^NEW WITNESS: Witch","/str","/ev",{"*":".^.c-0","flg":4},{"->":".^.^.^.8"},{"c-0":["\n",{"->":"witch_introduction"},{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n","^This Variant doesn't want to talk to you anymore.","\n","^You haven't found any clues. Restart the conversation?","\n","ev","str","^Go back","/str","/ev",{"*":".^.c-0","flg":4},{"->":".^.^.^.8"},{"c-0":["\n",{"->":"mutant_dialogue"},{"#f":5}]}]}],"nop","\n",{"#f":1}],"witch_introduction":["^As you get to the edge of town, the buildings start to fade away and you're left surrounded by dilapidated huts. The swamp is enshrouded by an otherwordly fog that clings to the ground and hangs in the air, casting a perpetual twilight. The trees are twisted and gnarled, their branches reaching out like skeletal fingers and the air is thick with the scent of damp earth and decaying vegetation.","\n",{"->":"swamp_description"},{"#f":1}],"swamp_description":[["^From the few huts, you spot several which seem to have been broken into, left in a state of disarray.","\n",["ev",{"^->":"swamp_description.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^The Oracle's Cabin: The workshop is stood above a particularly marshy area, connected to a patch of dry land by a rickety wooden bridge. Wind chimes made from bones and shells hang from the eaves, creating a haunting melody.",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"swamp_description.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",[["ev",{"^->":"swamp_description.0.c-0.7.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^The Alchemist's Workshop: A ramshacked building created by what seems like salvaged wood and metal, it has several chimneys protruding from it's roof emitting shining and strange coloured smoke. You can peer just inside the window and notice complex mechs and machine dominate the space, with shelves of exotic ingredients lining the walls.",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"swamp_description.0.c-0.7.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",[["ev",{"^->":"swamp_description.0.c-0.7.c-0.7.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^The summonser's lair: You can see that the hut is made from a much darker wood than any of the other houses, with bones scattered throughout. Throughout the structure, there are charms and protections scratched into the building, practically being cramped in to every possible surface.",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"swamp_description.0.c-0.7.c-0.7.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^Finally, in the middle of the swamp you see the Elder's hut standing. It is made from ancient, twisted trees and adorned with powerful wards and charms that you can sense, even from here. Inside, shelves have been overturned, books and scrolls scattered across the floor. The atmosphere is tense and foreboding, as if the very swamp itself holds its breath, waiting for what will happen next.","\n",{"->":"witch_dialogue"},{"#f":5}]}],{"#f":5}]}],{"#f":5}]}],{"#f":1}],"witch_dialogue":["^As you begin to move closer towards the Elder's hut, you see them emerge and start towards you.","\n",{"->":"witch_dialogue_2"},{"#f":1}],"witch_dialogue_2":[["ev","str",["ev","visit",8,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"ev","du",2,"==","/ev",{"->":".^.s2","c":true},"ev","du",3,"==","/ev",{"->":".^.s3","c":true},"ev","du",4,"==","/ev",{"->":".^.s4","c":true},"ev","du",5,"==","/ev",{"->":".^.s5","c":true},"ev","du",6,"==","/ev",{"->":".^.s6","c":true},"ev","du",7,"==","/ev",{"->":".^.s7","c":true},"ev","du",8,"==","/ev",{"->":".^.s8","c":true},"nop",{"s0":["pop","^'Your hut appears to have seen better days, do you know what happened? I'm trying to find the young girl, Lena, who went missing somewhere around here a few days ago''",{"->":".^.^.59"},null],"s1":["pop","^'I've seen her around here a few times before, always wandering where she shouldn't be. My hut was broken into the same night that she disappeared, I never thought that she'd have the audacity to enter my hut, let alone steal from it.'",{"->":".^.^.59"},null],"s2":["pop","^'Do you happen to know what exactly she took yet?'",{"->":".^.^.59"},null],"s3":["pop","^'She took a book, a very powerful grimoire. It contains spells that can easily overwhelm someone who doesn't understand their potency. I think she's close to doing something unwittingly that could put her in some serious danger.'",{"->":".^.^.59"},null],"s4":["pop","^'What kind of spells are we talking about here? Summoning, curses, transformations?'",{"->":".^.^.59"},null],"s5":["pop","^'I know she wanted to do anything she could  to try and prove herself to the village. There's a powerful spell to summon a protector of the village that she'd possibly use to drive out the variants. Although she isn't aware of what the spell requires to be given up in order to use it....'",{"->":".^.^.59"},null],"s6":["pop","^'... she can't do this spell alone either, there must be someone that she's trying to help to be able to fully complete this spell.'",{"->":".^.^.59"},null],"s7":["pop","^'Do you know any place that she might have gone with this person to try and complete the spell? Maybe a favourite spot around here, somewhere that's more remote for them to be able to complete the spell?'",{"->":".^.^.59"},null],"s8":["pop","^'There's a grove, not far from here. She used to play there, by the old willow tree. It's a place where the veil between worlds is thin.'",{"->":".^.^.59"},null],"#f":5}],"/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",["ev",{"VAR?":"WITCH_DIALOGUE"},1,"<=","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":"villager_introduction"},{"->":".^.^.^.3"},null]}],[{"->":".^.b"},{"b":["\n","ev",{"VAR?":"WITCH_DIALOGUE"},1,"-","/ev",{"VAR=":"WITCH_DIALOGUE","re":true},{"->":".^.^.^.^.^"},{"->":".^.^.^.3"},null]}],"nop","\n",{"#f":5}]}],{"#f":1}],"villager_introduction":["^The swamp seemed even more foreboding as you and the Elder make your way throught he mist, guided by a small light spell that she conjured. The trees loom overhead. Suddenly, you spot a the faint outline of a villager ahead, their lantern softly glowing. You approach the villager to see if you can get any information out of them.","\n",{"->":"villager_dialogue"},{"#f":1}],"villager_dialogue":[["ev","str",["ev","visit",3,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"ev","du",2,"==","/ev",{"->":".^.s2","c":true},"ev","du",3,"==","/ev",{"->":".^.s3","c":true},"nop",{"s0":["pop","^'Have you seen a young girl come by here in the last few days?'",{"->":".^.^.29"},null],"s1":["pop","^'Earlier, I saw her pass by with a stranger. A man dressed in dark robes, whispering to her. I didn't catch much, only that they're planning on heading to the old altar in the grove.'",{"->":".^.^.29"},null],"s2":["pop","^(Elder)'That altar hasn't been used in centuries, it's a place of ancient power. Did you notice anything else about this man?'",{"->":".^.^.29"},null],"s3":["pop","^'I couldn't properly see him, he appeared out of nowhere, but there was something off about him. His eyes glowed in the dark. I was only able to track him for a time before the mist thickened too much.'",{"->":".^.^.29"},null],"#f":5}],"/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",["ev",{"VAR?":"VILLAGER_INTRODUCTION"},1,"<=","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":"villager_ending"},{"->":".^.^.^.3"},null]}],[{"->":".^.b"},{"b":["\n","ev",{"VAR?":"VILLAGER_INTRODUCTION"},1,"-","/ev",{"VAR=":"VILLAGER_INTRODUCTION","re":true},{"->":".^.^.^.^.^"},{"->":".^.^.^.3"},null]}],"nop","\n",{"#f":5}]}],{"#f":1}],"villager_ending":["^The villager leads you through a narrow, winding path deeper into the swamp. The air grew cooler and an unnatural silence fell over the surroundings. After several tense minutes, you arrive at the grove. Through the trees, you can make out the old altar and in the flickering light of several candles, stood Lena and the mysterious man.","\n",{"->":"conclusion"},{"#f":1}],"suspect_introduction":[{"->":"suspect_conclusion"},{"#f":1}],"suspect_conclusion":[{"->":"conclusion"},{"#f":1}],"conclusion":["^You manage to rush over towards the man in the dark robes with the villager that guided you here. As you are rushing over, you see the elder start a chant to attempt at breaking the spell. The air crackled with magical energy as the elder begins her incantation, her voice raising in power. Lena drops the grimoire, frozen as she realises in horror where she is. She appears to finally be free from whatever spell that the mysterious man had put her under.","\n","^The Elder's chant reaches a crescendo and a brilliant light burst from her staff, enveloping the altar and the stranger. With a final, desperate cry, the dark-robed man was thrown back, the ritual shattered.","\n","end",{"#f":1}],"global decl":["ev",9,{"VAR=":"WITCH_DIALOGUE"},4,{"VAR=":"VILLAGER_INTRODUCTION"},"/ev","end",null],"#f":1}],"listDefs":{}}